using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Test011224
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
            Дана строка символов.Группы символов, разделенные пробелами(одним или несколькими) и
            не содержащие пробелов внутри себя, будем называть сло-вами.Подсчитать количество слов 
            в данной строке длиной в пять символов.*/

            char cr = ' ';

            string str = "Таким образом, повышение уровня гражданского сознания представляет собой интересный эксперимент" +
                " проверки дальнейших направлений развитая системы массового участия! Значимость этих проблем настолько очевидна," +
                " что постоянный количественный рост и сфера нашей активности напрямую зависит от экономической целесообразности" +
                " принимаемых решений. Повседневная практика показывает, что курс на социально-ориентированный национальный проект" +
                " обеспечивает широкому кругу специалистов участие в формировании ключевых компонентов планируемого обновления?" +
                " Соображения высшего порядка, а также рамки и место обучения кадров способствует повышению актуальности направлений" +
                " прогрессивного развития. Задача организации, в особенности же новая модель организационной деятельности обеспечивает" +
                " широкому кругу специалистов участие в формировании модели развития? Таким образом, консультация с профессионалами из IT" +
                " обеспечивает широкому кругу специалистов участие в формировании позиций, занимаемых участниками в отношении поставленных" +
                " задач. Дорогие друзья, сложившаяся структура организации в значительной степени обуславливает создание форм воздействия." +
                " Дорогие друзья, рамки и место обучения кадров обеспечивает широкому кругу специалистов участие в формировании существующих" +
                " финансовых и административных условий. Равным образом консультация с профессионалами из IT способствует повышению актуальности" +
                " всесторонне сбалансированных нововведений. Значимость этих проблем настолько очевидна, что сложившаяся структура организации" +
                " напрямую зависит от модели развития. Разнообразный и богатый опыт начало повседневной работы по формированию позиции обеспечивает" +
                " широкому кругу специалистов участие в формировании позиций, занимаемых участниками в отношении поставленных задач! Не следует," +
                " однако, забывать о том, что социально-экономическое развитие требует определения и уточнения соответствующих условий активизации." +
                " Таким образом, дальнейшее развитие различных форм деятельности способствует повышению актуальности дальнейших направлений развитая" +
                " системы массового участия! Соображения высшего порядка, а также сложившаяся структура организации играет важную роль в формировании" +
                " всесторонне сбалансированных нововведений. Повседневная практика показывает, что курс на социально-ориентированный национальный проект влечет за собой процесс внедрения и модернизации всесторонне сбалансированных нововведений! Дорогие друзья, сложившаяся структура организации напрямую зависит от системы обучения кадров, соответствующей насущным потребностям! С другой стороны постоянный количественный рост и сфера нашей активности требует от нас анализа соответствующих условий активизации. Таким образом, выбранный нами инновационный путь позволяет оценить значение дальнейших направлений развитая системы массового участия. Повседневная практика показывает, что социально-экономическое развитие требует от нас анализа системы обучения кадров, соответствующей насущным потребностям. Повседневная практика показывает, что повышение уровня гражданского сознания позволяет выполнить важнейшие задания по разработке дальнейших направлений развития проекта. Разнообразный и богатый опыт выбранный нами инновационный путь влечет за собой процесс внедрения и модернизации системы масштабного изменения ряда параметров. Повседневная практика показывает, что курс на социально-ориентированный национальный проект напрямую зависит от дальнейших направлений развития проекта! Не следует, однако, забывать о том, что сложившаяся структура организации обеспечивает широкому кругу специалистов участие в формировании дальнейших направлений развитая системы массового участия. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствующей насущным потребностям. Не следует, однако, забывать о том, что курс на социально-ориентированный национальный проект позволяет выполнить важнейшие задания по разработке экономической целесообразности принимаемых решений. Равным образом новая модель организационной деятельности влечет за собой процесс внедрения и модернизации новых предложений. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности требует определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Равным образом постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации новых предложений. Равным образом выбранный нами инновационный путь обеспечивает актуальность системы масштабного изменения ряда параметров. Разнообразный и богатый опыт консультация с профессионалами из IT обеспечивает широкому кругу специалистов участие в формировании новых предложений. Разнообразный и богатый опыт реализация намеченного плана развития напрямую зависит от системы обучения кадров, соответствующей насущным потребностям! Практический опыт показывает, что рамки и место обучения кадров влечет за собой процесс внедрения и модернизации ключевых компонентов планируемого обновления! Значимость этих проблем настолько очевидна, что реализация намеченного плана развития обеспечивает широкому кругу специалистов участие в формировании соответствующих условий активизации. Равным образом консультация с профессионалами из IT создаёт предпосылки качественно новых шагов для системы масштабного изменения ряда параметров! Дорогие друзья, сложившаяся структура организации требует от нас системного анализа системы обучения кадров, соответствующей насущным потребностям? Повседневная практика показывает, что консультация с профессионалами из IT играет важную роль в формировании соответствующих условий активизации. Значимость этих проблем настолько очевидна, что консультация с профессионалами из IT влечет за собой процесс внедрения и модернизации экономической целесообразности принимаемых решений.\r\n\r\nТаким образом, рамки и место обучения кадров играет важную роль в формировании ключевых компонентов планируемого обновления? Дорогие друзья, социально-экономическое развитие играет важную роль в формировании форм воздействия. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки соответствующих условий активизации. Разнообразный и богатый опыт новая модель организационной деятельности обеспечивает актуальность соответствующих условий активизации. Не следует, однако, забывать о том, что консультация с профессионалами из IT требует от нас системного анализа модели развития. Практический опыт показывает, что дальнейшее развитие различных форм деятельности играет важную роль в формировании экономической целесообразности принимаемых решений? Равным образом постоянный количественный рост и сфера нашей активности позволяет выполнить важнейшие задания по разработке соответствующих условий активизации? Повседневная практика показывает, что начало повседневной работы по формированию позиции позволяет выполнить важнейшие задания по разработке системы обучения кадров, соответствующей насущным потребностям? Практический опыт показывает, что постоянное информационно-техническое обеспечение нашей деятельности способствует подготовке и реализации существующих финансовых и административных условий. Соображения высшего порядка, а также социально-экономическое развитие требует от нас анализа системы масштабного изменения ряда параметров. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров способствует повышению актуальности системы обучения кадров, соответствующей насущным потребностям. Задача организации, в особенности же консультация с профессионалами из IT создаёт предпосылки качественно новых шагов для экономической целесообразности принимаемых решений. Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности в значительной степени обуславливает создание модели развития! Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности способствует повышению актуальности соответствующих условий активизации? Повседневная практика показывает, что курс на социально-ориентированный национальный проект играет важную роль в формировании системы обучения кадров, соответствующей насущным потребностям! Не следует, однако, забывать о том, что консультация с профессионалами из IT влечет за собой процесс внедрения и модернизации дальнейших направлений развитая системы массового участия. Не следует, однако, забывать о том, что реализация намеченного плана развития способствует повышению актуальности ключевых компонентов планируемого обновления. Равным образом консультация с профессионалами из IT обеспечивает широкому кругу специалистов участие в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны повышение уровня гражданского сознания влечет за собой процесс внедрения и модернизации направлений прогрессивного развития. Таким образом, начало повседневной работы по формированию позиции обеспечивает актуальность системы масштабного изменения ряда параметров. Разнообразный и богатый опыт реализация намеченного плана развития требует от нас системного анализа позиций, занимаемых участниками в отношении поставленных задач? С другой стороны выбранный нами инновационный путь позволяет оценить значение системы обучения кадров, соответствующей насущным потребностям. Не следует, однако, забывать о том, что постоянный количественный рост и сфера нашей активности требует от нас системного анализа направлений прогрессивного развития? Практический опыт показывает, что дальнейшее развитие различных форм деятельности способствует подготовке и реализации направлений прогрессивного развития. Дорогие друзья, начало повседневной работы по формированию позиции способствует повышению актуальности модели развития. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности требует от нас анализа дальнейших направлений развитая системы массового участия? Равным образом курс на социально-ориентированный национальный проект играет важную роль в формировании форм воздействия. Задача организации, в особенности же новая модель организационной деятельности позволяет выполнить важнейшие задания по разработке новых предложений? Равным образом выбранный нами инновационный путь играет важную роль в формировании дальнейших направлений развития проекта. Соображения высшего порядка, а также курс на социально-ориентированный национальный проект влечет за собой процесс внедрения и модернизации экономической целесообразности принимаемых решений. Повседневная практика показывает, что сложившаяся структура организации создаёт предпосылки качественно новых шагов для системы масштабного изменения ряда параметров. Задача организации, в особенности же новая модель организационной деятельности играет важную роль в формировании модели развития. Разнообразный и богатый опыт консультация с профессионалами из IT требует определения и уточнения модели развития! Практический опыт показывает, что курс на социально-ориентированный национальный проект обеспечивает широкому кругу специалистов участие в формировании новых предложений. Практический опыт показывает, что постоянный количественный рост и сфера нашей активности играет важную роль в формировании форм воздействия? Дорогие друзья, консультация с профессионалами из IT требует от нас анализа модели развития? Задача организации, в особенности же повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании существующих финансовых и административных условий. С другой стороны выбранный нами инновационный путь играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач.\r\n\r\nТаким образом, постоянное информационно-техническое обеспечение нашей деятельности способствует повышению актуальности системы обучения кадров, соответствующей насущным потребностям! Задача организации, в особенности же повышение уровня гражданского сознания влечет за собой процесс внедрения и модернизации дальнейших направлений развития проекта. Задача организации, в особенности же сложившаяся структура организации требует от нас системного анализа форм воздействия? С другой стороны социально-экономическое развитие обеспечивает широкому кругу специалистов участие в формировании системы масштабного изменения ряда параметров. Таким образом, новая модель организационной деятельности напрямую зависит от направлений прогрессивного развития. Задача организации, в особенности же повышение уровня гражданского сознания играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач? Значимость этих проблем настолько очевидна, что повышение уровня гражданского сознания в значительной степени обуславливает создание существующих финансовых и административных условий. Разнообразный и богатый опыт курс на социально-ориентированный национальный проект напрямую зависит от направлений прогрессивного развития. Разнообразный и богатый опыт сложившаяся структура организации позволяет оценить значение новых предложений. Соображения высшего порядка, а также начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации экономической целесообразности принимаемых решений. Задача организации, в особенности же новая модель организационной деятельности играет важную роль в формировании экономической целесообразности принимаемых решений? Не следует, однако, забывать о том, что дальнейшее развитие различных форм деятельности способствует повышению актуальности направлений прогрессивного развития? Таким образом, постоянное информационно-техническое обеспечение нашей деятельности создаёт предпосылки качественно новых шагов для позиций, занимаемых участниками в отношении поставленных задач! Значимость этих проблем настолько очевидна, что социально-экономическое развитие требует определения и уточнения новых предложений. Таким образом, повышение уровня гражданского сознания обеспечивает широкому кругу специалистов участие в формировании ключевых компонентов планируемого обновления? Не следует, однако, забывать о том, что постоянное информационно-техническое обеспечение нашей деятельности требует от нас системного анализа дальнейших направлений развития проекта. Повседневная практика показывает, что социально-экономическое развитие обеспечивает широкому кругу специалистов участие в формировании дальнейших направлений развитая системы массового участия. Разнообразный и богатый опыт повышение уровня гражданского сознания позволяет выполнить важнейшие задания по разработке экономической целесообразности принимаемых решений. Соображения высшего порядка, а также сложившаяся структура организации в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач! Равным образом постоянный количественный рост и сфера нашей активности создаёт предпосылки качественно новых шагов для позиций, занимаемых участниками в отношении поставленных задач. Повседневная практика показывает, что постоянное информационно-техническое обеспечение нашей деятельности требует определения и уточнения всесторонне сбалансированных нововведений! Таким образом, курс на социально-ориентированный национальный проект обеспечивает актуальность системы масштабного изменения ряда параметров. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности напрямую зависит от форм воздействия. Задача организации, в особенности же рамки и место обучения кадров способствует повышению актуальности соответствующих условий активизации. Практический опыт показывает, что начало повседневной работы по формированию позиции позволяет выполнить важнейшие задания по разработке форм воздействия. Практический опыт показывает, что новая модель организационной деятельности создаёт предпосылки качественно новых шагов для всесторонне сбалансированных нововведений. Практический опыт показывает, что консультация с профессионалами из IT обеспечивает актуальность всесторонне сбалансированных нововведений. Значимость этих проблем настолько очевидна, что консультация с профессионалами из IT позволяет оценить значение существующих финансовых и административных условий? Соображения высшего порядка, а также консультация с профессионалами из IT влечет за собой процесс внедрения и модернизации дальнейших направлений развитая системы массового участия. Задача организации, в особенности же рамки и место обучения кадров позволяет выполнить важнейшие задания по разработке дальнейших направлений развитая системы массового участия? Разнообразный и богатый опыт новая модель организационной деятельности позволяет выполнить важнейшие задания по разработке направлений прогрессивного развития. Разнообразный и богатый опыт новая модель организационной деятельности обеспечивает широкому кругу специалистов участие в формировании направлений прогрессивного развития! Значимость этих проблем настолько очевидна, что повышение уровня гражданского сознания способствует подготовке и реализации ключевых компонентов планируемого обновления! Задача организации, в особенности же новая модель организационной деятельности играет важную роль в формировании новых предложений. Практический опыт показывает, что постоянное информационно-техническое обеспечение нашей деятельности позволяет оценить значение дальнейших направлений развитая системы массового участия!\r\n\r\nНе следует, однако, забывать о том, что консультация с профессионалами из IT позволяет выполнить важнейшие задания по разработке позиций, занимаемых участниками в отношении поставленных задач! Не следует, однако, забывать о том, что дальнейшее развитие различных форм деятельности позволяет выполнить важнейшие задания по разработке модели развития. Разнообразный и...";

            char[] arrCr = str.ToCharArray();
            string str1 = "";

            for (int i = 0; i < str.Length; i++)
            {
                str1 += arrCr[i];

                if (str1.Length == 5 && str1[0] != ' ' && str1[1] != ' ' && str1[2] != ' ' && str1[3] != ' ' && str1[4] != ' ')
                {
                    Console.WriteLine(str1);
                    str1 = "";
                }
                else if (arrCr[i] == ' ') 
                {
                    str1 = "" ;
                }


            }
        }
    }
}
